const HIRAGANA = {
    "あ": "a", "い": "i", "う": "u", "え": "e", "お": "o",
    "か": "ka", "き": "ki", "く": "ku", "け": "ke", "こ": "ko",
    "さ": "sa", "し": "shi", "す": "su", "せ": "se", "そ": "so",
    "た": "ta", "ち": "chi", "つ": "tsu", "て": "te", "と": "to",
    "な": "na", "に": "ni", "ぬ": "nu", "ね": "ne", "の": "no",
    "は": "ha", "ひ": "hi", "ふ": "fu", "へ": "he", "ほ": "ho",
    "ま": "ma", "み": "mi", "む": "mu", "め": "me", "も": "mo",
    "や": "ya", "ゆ": "yu", "よ": "yo",
    "ら": "ra", "り": "ri", "る": "ru", "れ": "re", "ろ": "ro",
    "わ": "wa", "を": "wo", "ん": "n",
    // dakuten
    "が": "ga", "ぎ": "gi", "ぐ": "gu", "げ": "ge", "ご": "go",
    "ざ": "za", "じ": "ji", "ず": "zu", "ぜ": "ze", "ぞ": "zo",
    "だ": "da", "ぢ": "ji", "づ": "zu", "で": "de", "ど": "do",
    "ば": "ba", "び": "bi", "ぶ": "bu", "べ": "be", "ぼ": "bo",
    "ぱ": "pa", "ぴ": "pi", "ぷ": "pu", "ぺ": "pe", "ぽ": "po",

    // combinations
    "きゃ": "kya", "きゅ": "kyu", "きょ": "kyo",
    "しゃ": "sha", "しゅ": "shu", "しょ": "sho",
    "ちゃ": "cha", "ちゅ": "chu", "ちょ": "cho",
    "にゃ": "nya", "にゅ": "nyu", "にょ": "nyo",
    "ひゃ": "hya", "ひゅ": "hyu", "ひょ": "hyo",
    "みゃ": "mya", "みゅ": "myu", "みょ": "myo",
    "りゃ": "rya", "りゅ": "ryu", "りょ": "ryo",

    // voiced combos
    "ぎゃ": "gya", "ぎゅ": "gyu", "ぎょ": "gyo",
    "じゃ": "ja", "じゅ": "ju", "じょ": "jo",
    "びゃ": "bya", "びゅ": "byu", "びょ": "byo",
    "ぴゃ": "pya", "ぴゅ": "pyu", "ぴょ": "pyo"
}

const HIRA_GROUPS = [

    { kana: "あ", label: "a", set: ["あ", "い", "う", "え", "お"] },
    { kana: "か", label: "ka", set: ["か", "き", "く", "け", "こ"] },
    { kana: "さ", label: "sa", set: ["さ", "し", "す", "せ", "そ"] },
    { kana: "た", label: "ta", set: ["た", "ち", "つ", "て", "と"] },
    { kana: "な", label: "na", set: ["な", "に", "ぬ", "ね", "の"] },
    { kana: "は", label: "ha", set: ["は", "ひ", "ふ", "へ", "ほ"] },
    { kana: "ま", label: "ma", set: ["ま", "み", "む", "め", "も"] },
    { kana: "や", label: "ya", set: ["や", "ゆ", "よ"] },
    { kana: "ら", label: "ra", set: ["ら", "り", "る", "れ", "ろ"] },
    { kana: "わ", label: "wa", set: ["わ", "を", "ん"] }

]


const DAKUTEN = {

    "か": ["が", "ぎ", "ぐ", "げ", "ご"],
    "さ": ["ざ", "じ", "ず", "ぜ", "ぞ"],
    "た": ["だ", "ぢ", "づ", "で", "ど"],
    "は": ["ば", "び", "ぶ", "べ", "ぼ", "ぱ", "ぴ", "ぷ", "ぺ", "ぽ"]

}

const COMBO = {

    "き": ["きゃ", "きゅ", "きょ"],
    "し": ["しゃ", "しゅ", "しょ"],
    "ち": ["ちゃ", "ちゅ", "ちょ"],
    "に": ["にゃ", "にゅ", "にょ"],
    "ひ": ["ひゃ", "ひゅ", "ひょ"],
    "み": ["みゃ", "みゅ", "みょ"],
    "り": ["りゃ", "りゅ", "りょ"],

    "ぎ": ["ぎゃ", "ぎゅ", "ぎょ"],
    "じ": ["じゃ", "じゅ", "じょ"],
    "び": ["びゃ", "びゅ", "びょ"],
    "ぴ": ["ぴゃ", "ぴゅ", "ぴょ"]

}
