const HIRAGANA = {
    "あ": "a", "い": "i", "う": "u", "え": "e", "お": "o",
    "か": "ka", "き": "ki", "く": "ku", "け": "ke", "こ": "ko",
    "さ": "sa", "し": "shi", "す": "su", "せ": "se", "そ": "so",
    "た": "ta", "ち": "chi", "つ": "tsu", "て": "te", "と": "to",
    "な": "na", "に": "ni", "ぬ": "nu", "ね": "ne", "の": "no",
    "は": "ha", "ひ": "hi", "ふ": "fu", "へ": "he", "ほ": "ho",
    "ま": "ma", "み": "mi", "む": "mu", "め": "me", "も": "mo",
    "や": "ya", "ゆ": "yu", "よ": "yo",
    "ら": "ra", "り": "ri", "る": "ru", "れ": "re", "ろ": "ro",
    "わ": "wa", "を": "wo", "ん": "n"
}

const HIRA_GROUPS = [

    { kana: "あ", label: "a", set: ["あ", "い", "う", "え", "お"] },
    { kana: "か", label: "ka", set: ["か", "き", "く", "け", "こ"] },
    { kana: "さ", label: "sa", set: ["さ", "し", "す", "せ", "そ"] },
    { kana: "た", label: "ta", set: ["た", "ち", "つ", "て", "と"] },
    { kana: "な", label: "na", set: ["な", "に", "ぬ", "ね", "の"] },
    { kana: "は", label: "ha", set: ["は", "ひ", "ふ", "へ", "ほ"] },
    { kana: "ま", label: "ma", set: ["ま", "み", "む", "め", "も"] },
    { kana: "や", label: "ya", set: ["や", "ゆ", "よ"] },
    { kana: "ら", label: "ra", set: ["ら", "り", "る", "れ", "ろ"] },
    { kana: "わ", label: "wa", set: ["わ", "を", "ん"] }

]


