const KATAKANA = {
    "ア": "a", "イ": "i", "ウ": "u", "エ": "e", "オ": "o",
    "カ": "ka", "キ": "ki", "ク": "ku", "ケ": "ke", "コ": "ko",
    "サ": "sa", "シ": "shi", "ス": "su", "セ": "se", "ソ": "so",
    "タ": "ta", "チ": "chi", "ツ": "tsu", "テ": "te", "ト": "to",
    "ナ": "na", "ニ": "ni", "ヌ": "nu", "ネ": "ne", "ノ": "no",
    "ハ": "ha", "ヒ": "hi", "フ": "fu", "ヘ": "he", "ホ": "ho",
    "マ": "ma", "ミ": "mi", "ム": "mu", "メ": "me", "モ": "mo",
    "ヤ": "ya", "ユ": "yu", "ヨ": "yo",
    "ラ": "ra", "リ": "ri", "ル": "ru", "レ": "re", "ロ": "ro",
    "ワ": "wa", "ヲ": "wo", "ン": "n"
}


const KATA_GROUPS = [

    { kana: "ア", label: "a", set: ["ア", "イ", "ウ", "エ", "オ"] },
    { kana: "カ", label: "ka", set: ["カ", "キ", "ク", "ケ", "コ"] },
    { kana: "サ", label: "sa", set: ["サ", "シ", "ス", "セ", "ソ"] },
    { kana: "タ", label: "ta", set: ["タ", "チ", "ツ", "テ", "ト"] },
    { kana: "ナ", label: "na", set: ["ナ", "ニ", "ヌ", "ネ", "ノ"] },
    { kana: "ハ", label: "ha", set: ["ハ", "ヒ", "フ", "ヘ", "ホ"] },
    { kana: "マ", label: "ma", set: ["マ", "ミ", "ム", "メ", "モ"] },
    { kana: "ヤ", label: "ya", set: ["ヤ", "ユ", "ヨ"] },
    { kana: "ラ", label: "ra", set: ["ラ", "リ", "ル", "レ", "ロ"] },
    { kana: "ワ", label: "wa", set: ["ワ", "ヲ", "ン"] }

]

