const KATAKANA = {

    // base
    "ア": "a", "イ": "i", "ウ": "u", "エ": "e", "オ": "o",
    "カ": "ka", "キ": "ki", "ク": "ku", "ケ": "ke", "コ": "ko",
    "サ": "sa", "シ": "shi", "ス": "su", "セ": "se", "ソ": "so",
    "タ": "ta", "チ": "chi", "ツ": "tsu", "テ": "te", "ト": "to",
    "ナ": "na", "ニ": "ni", "ヌ": "nu", "ネ": "ne", "ノ": "no",
    "ハ": "ha", "ヒ": "hi", "フ": "fu", "ヘ": "he", "ホ": "ho",
    "マ": "ma", "ミ": "mi", "ム": "mu", "メ": "me", "モ": "mo",
    "ヤ": "ya", "ユ": "yu", "ヨ": "yo",
    "ラ": "ra", "リ": "ri", "ル": "ru", "レ": "re", "ロ": "ro",
    "ワ": "wa", "ヲ": "wo", "ン": "n",

    // dakuten
    "ガ": "ga", "ギ": "gi", "グ": "gu", "ゲ": "ge", "ゴ": "go",
    "ザ": "za", "ジ": "ji", "ズ": "zu", "ゼ": "ze", "ゾ": "zo",
    "ダ": "da", "ヂ": "ji", "ヅ": "zu", "デ": "de", "ド": "do",
    "バ": "ba", "ビ": "bi", "ブ": "bu", "ベ": "be", "ボ": "bo",

    // handakuten
    "パ": "pa", "ピ": "pi", "プ": "pu", "ペ": "pe", "ポ": "po",

    // combinations
    "キャ": "kya", "キュ": "kyu", "キョ": "kyo",
    "シャ": "sha", "シュ": "shu", "ショ": "sho",
    "チャ": "cha", "チュ": "chu", "チョ": "cho",
    "ニャ": "nya", "ニュ": "nyu", "ニョ": "nyo",
    "ヒャ": "hya", "ヒュ": "hyu", "ヒョ": "hyo",
    "ミャ": "mya", "ミュ": "myu", "ミョ": "myo",
    "リャ": "rya", "リュ": "ryu", "リョ": "ryo",

    // voiced combinations
    "ギャ": "gya", "ギュ": "gyu", "ギョ": "gyo",
    "ジャ": "ja", "ジュ": "ju", "ジョ": "jo",
    "ビャ": "bya", "ビュ": "byu", "ビョ": "byo",
    "ピャ": "pya", "ピュ": "pyu", "ピョ": "pyo"

}


const KATA_GROUPS = [

    { kana: "ア", label: "a", set: ["ア", "イ", "ウ", "エ", "オ"] },
    { kana: "カ", label: "ka", set: ["カ", "キ", "ク", "ケ", "コ"] },
    { kana: "サ", label: "sa", set: ["サ", "シ", "ス", "セ", "ソ"] },
    { kana: "タ", label: "ta", set: ["タ", "チ", "ツ", "テ", "ト"] },
    { kana: "ナ", label: "na", set: ["ナ", "ニ", "ヌ", "ネ", "ノ"] },
    { kana: "ハ", label: "ha", set: ["ハ", "ヒ", "フ", "ヘ", "ホ"] },
    { kana: "マ", label: "ma", set: ["マ", "ミ", "ム", "メ", "モ"] },
    { kana: "ヤ", label: "ya", set: ["ヤ", "ユ", "ヨ"] },
    { kana: "ラ", label: "ra", set: ["ラ", "リ", "ル", "レ", "ロ"] },
    { kana: "ワ", label: "wa", set: ["ワ", "ヲ", "ン"] }

]


const KATA_DAKUTEN = {

    "カ": ["ガ", "ギ", "グ", "ゲ", "ゴ"],
    "サ": ["ザ", "ジ", "ズ", "ゼ", "ゾ"],
    "タ": ["ダ", "ヂ", "ヅ", "デ", "ド"],
    "ハ": ["バ", "ビ", "ブ", "ベ", "ボ", "パ", "ピ", "プ", "ペ", "ポ"]

}


const KATA_COMBO = {

    "キ": ["キャ", "キュ", "キョ"],
    "シ": ["シャ", "シュ", "ショ"],
    "チ": ["チャ", "チュ", "チョ"],
    "ニ": ["ニャ", "ニュ", "ニョ"],
    "ヒ": ["ヒャ", "ヒュ", "ヒョ"],
    "ミ": ["ミャ", "ミュ", "ミョ"],
    "リ": ["リャ", "リュ", "リョ"],

    "ギ": ["ギャ", "ギュ", "ギョ"],
    "ジ": ["ジャ", "ジュ", "ジョ"],
    "ビ": ["ビャ", "ビュ", "ビョ"],
    "ピ": ["ピャ", "ピュ", "ピョ"]

}
