const MIXED_KANA = {
    ...HIRAGANA,
    ...KATAKANA
}


const MIX_GROUPS = [

    { kana: "あア", label: "a", set: ["あ", "い", "う", "え", "お", "ア", "イ", "ウ", "エ", "オ"] },
    { kana: "かカ", label: "ka", set: ["か", "き", "く", "け", "こ", "カ", "キ", "ク", "ケ", "コ"] },
    { kana: "さサ", label: "sa", set: ["さ", "し", "す", "せ", "そ", "サ", "シ", "ス", "セ", "ソ"] },
    { kana: "たタ", label: "ta", set: ["た", "ち", "つ", "て", "と", "タ", "チ", "ツ", "テ", "ト"] },
    { kana: "なナ", label: "na", set: ["な", "に", "ぬ", "ね", "の", "ナ", "ニ", "ヌ", "ネ", "ノ"] },
    { kana: "はハ", label: "ha", set: ["は", "ひ", "ふ", "へ", "ほ", "ハ", "ヒ", "フ", "ヘ", "ホ"] },
    { kana: "まマ", label: "ma", set: ["ま", "み", "む", "め", "も", "マ", "ミ", "ム", "メ", "モ"] },
    { kana: "やヤ", label: "ya", set: ["や", "ゆ", "よ", "ヤ", "ユ", "ヨ"] },
    { kana: "らラ", label: "ra", set: ["ら", "り", "る", "れ", "ろ", "ラ", "リ", "ル", "レ", "ロ"] },
    { kana: "わワ", label: "wa", set: ["わ", "を", "ん", "ワ", "ヲ", "ン"] }

]
